blogger/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		@articles = Article.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@article = Article.find(params[:id])